<?php
/**
 * @package	  FormManager
 * @copyright 2008, Peter Gribanov
 * @link      http://peter-gribanov.ru/license
 * @license   GNU GPL Version 3
 */

return array(
	'default_submit_title' => 'Отправить',
	'required_fields'      => 'Поля обязательные для заполнения',
	'null'                 => 'Нет информации о поле - %s.',
	'empty'                => 'Вы не заполнили поле - %s.',
	'int'                  => 'Вы указали не целое число в поле - %s.',
	'float'                => 'Вы указали не число с плавающей запятой в поле - %s.',
	'bool'                 => 'Указанное Вами значение не является одним из двух допустимых%2$s для поля - %1$s.',
	'length'               => 'Вы указали значение длинною меньше %2$s или больше %3$s символов для поля - %1$s.',
	'length.eq'            => 'Вы указали значение длина которого не равна %2$s символов для поля - %1$s.',
	'length.min'           => 'Вы указали значение длинною меньше %2$s символов для поля - %1$s.',
	'length.max'           => 'Вы указали значение длинною больше %2$s символов для поля - %1$s.',
	'email'	               => 'Вы указали некорректный E-Mail в поле - %s.',
	'select'	           => 'Указанное Вами значение не является одним из списка для поля - %s.',
	'captcha'	           => 'Вы указали некорректный код подтверждения в поле - %s.',
	'captcha-length'	   => 'Код подтверждения состоит из %s символов.',
	'captcha-link'	       => 'При плохой разборчивости %sобновите%s код.',
	'date'	               => 'Указанная Вами дата в поле %s не соответствует формату DD.MM.YYYY.',
	'field-yesno-yes'	   => 'Да',
	'field-yesno-no'	   => 'Нет',
);